Repository: ggegelya/ExpenseTracker
Catalog: ExpenseTracker/Localizable.xcstrings
Source language: en
Languages: uk

# accessibility.amount %@
source: Amount: %@
uk: Сума: %@

# account.add
source: Add Account
uk: Додати рахунок

# account.balanceMayBeNegative
source: May be negative
uk: Може бути від'ємним

# account.basicInfo
source: Basic Information
uk: Основна інформація

# account.create
source: Create Account
uk: Створити рахунок

# account.currency
source: Currency
uk: Валюта

# account.default
source: Default
uk: За замовчуванням

# account.default_card
source: Main Card
uk: Основна картка

# account.defaultAccountDescription
source: Default account will be selected automatically for new transactions
uk: Основний рахунок буде обраний за замовчуванням для нових транзакцій

# account.deleteConfirm.message %@
source: Are you sure you want to delete account "%@"?
uk: Ви впевнені, що хочете видалити рахунок "%@"?

# account.deleteConfirm.title
source: Delete Account?
uk: Видалити рахунок?

# account.detail.title
source: Account Details
uk: Деталі рахунку

# account.editTitle
source: Edit Account
uk: Редагувати рахунок

# account.empty.subtitle
source: Create your first account
uk: Створіть свій перший рахунок

# account.empty.title
source: No Accounts
uk: Немає рахунків

# account.initialBalance
source: Initial Balance
uk: Початковий баланс

# account.lastTransaction
source: Last Transaction
uk: Остання транзакція

source: Account Name
uk: Назва рахунку

# account.nameExample
source: e.g., Monobank, Cash
uk: Наприклад: Монобанк, Готівка

# account.new
source: New Account
uk: Новий рахунок

# account.recentTransactions
source: Recent Transactions
uk: Останні транзакції

# account.select
source: Select Account
uk: Оберіть рахунок

# account.setAsDefault
source: Set as Default
uk: Встановити як основний

# account.setDefault
source: Set as Default
uk: Встановити за замовчуванням

# account.tagDescription
source: Unique account identifier (starts with #)
uk: Унікальний ідентифікатор рахунку (починається з #)

# account.tagField
source: Tag
uk: Тег

# account.totalBalance
source: Total Balance
uk: Загальний баланс

source: Account Type
uk: Тип рахунку

# accountType.card
source: Card
uk: Картка

# accountType.cash
source: Cash
uk: Готівка

# accountType.investment
source: Investment
uk: Інвестиції

# accountType.savings
source: Savings
uk: Накопичення

# analytics.addTransactionsForAnalysis
source: Add transactions for analysis
uk: Додайте транзакції для аналізу

# analytics.addTransactionsWithCategories
source: Add transactions with categories
uk: Додайте транзакції з категоріями

# analytics.allMerchants
source: All Merchants
uk: Всі продавці

# analytics.average
source: Average
uk: Середнє

# analytics.averageDailySpending
source: Average Daily Spending
uk: Середні витрати на день

# analytics.balance
source: Balance
uk: Баланс

# analytics.categoryBreakdown
source: Category Breakdown
uk: Розподіл за категоріями

# analytics.categoryCount %lld
source: %lld categories
uk: %lld категорій

# analytics.comparison
source: Comparison
uk: Порівняння

# analytics.currentMonth
source: Current Month
uk: Поточний місяць

# analytics.custom
source: Custom Period
uk: Власний період

# analytics.detailedOverview
source: Detailed Overview
uk: Детальний огляд

# analytics.empty.addTransaction
source: Add Transaction
uk: Додати транзакцію

# analytics.empty.explanation
source: Analytics becomes available after at least 3 transactions so trends are meaningful.
uk: Аналітика стає доступною після щонайменше 3 транзакцій, щоб тренди були значущими.

# analytics.empty.goToTransactions
source: Go to Transactions
uk: Перейти до транзакцій

# analytics.empty.progress %lld %lld
source: %1$lld of %2$lld transactions
uk: %1$lld з %2$lld транзакцій

# analytics.empty.unlockTitle %lld
source: Add %lld more transactions to unlock Analytics
uk: Додайте ще %lld транзакцій, щоб відкрити Аналітику

# analytics.empty.zeroTitle
source: No data yet
uk: Даних ще немає

# analytics.expenses
source: Expenses
uk: Витрати

# analytics.highest
source: Highest
uk: Найвищі

# analytics.income
source: Income
uk: Доходи

# analytics.invalidDateRange
source: Start date must be before end date
uk: Початкова дата має бути раніше кінцевої

# analytics.last3Months
source: Last 3 Months
uk: Останні 3 місяці

# analytics.lastMonth
source: Last Month
uk: Минулий місяць

# analytics.lowest
source: Lowest
uk: Найнижчі

# analytics.million
source: M
uk: млн

# analytics.monthOverview
source: Month Overview
uk: Огляд місяця

# analytics.moreCategories %lld
source: + %lld more categories
uk: + ще %lld категорій

# analytics.noData
source: No Data
uk: Немає даних

# analytics.noDataForPeriod
source: No data for this period
uk: Немає даних за цей період

# analytics.previousExpenses
source: Previous Month Expenses
uk: Витрати минулого місяця

# analytics.previousIncome
source: Previous Month Income
uk: Доходи минулого місяця

# analytics.selectPeriod
source: Select Period
uk: Оберіть період

# analytics.spendingTrend
source: Spending Trend
uk: Тренд витрат

# analytics.statistics
source: Statistics
uk: Статистика

# analytics.summary
source: Summary
uk: Підсумки

# analytics.thousand
source: K
uk: тис

# analytics.topMerchants
source: Top Merchants
uk: Топ продавці

# analytics.totalExpenses
source: Total Expenses
uk: Загальні витрати

# analytics.totalIncome
source: Total Income
uk: Загальні доходи

# analytics.transactionCount %lld
source: %lld transactions
uk: %lld транзакцій

# analytics.uncategorized
source: Uncategorized
uk: Без категорії

# bulk.deleteConfirm.message %lld
source: Are you sure you want to delete %lld transactions?
uk: Ви впевнені, що хочете видалити %lld транзакцій?

# bulk.deleteConfirm.title
source: Delete Transactions?
uk: Видалити транзакції?

# bulk.deselectAll
source: Deselect All
uk: Зняти виділення

# bulk.of %lld
source: of %lld transactions
uk: з %lld транзакцій

# bulk.selectAll
source: Select All
uk: Обрати всі

# bulk.selected %lld
source: %lld selected
uk: %lld обрано

# category.all
source: All Categories
uk: Всі категорії

# category.beauty
source: Beauty
uk: Краса

# category.cafe
source: Cafe
uk: Кафе

# category.clothing
source: Clothing
uk: Одяг

# category.createInSettings
source: Create categories in settings
uk: Створіть категорії в налаштуваннях

# category.education
source: Education
uk: Навчання

# category.electronics
source: Electronics
uk: Техніка

# category.entertainment
source: Entertainment
uk: Розваги

# category.gifts
source: Gifts
uk: Подарунки

# category.groceries
source: Groceries
uk: Продукти

# category.health
source: Health
uk: Здоров'я

# category.other
source: Other
uk: Інше

# category.pharmacy
source: Pharmacy
uk: Аптека

# category.recentlyUsed
source: Recently Used
uk: Останні використані

# category.salary
source: Salary
uk: Зарплата

# category.sports
source: Sports
uk: Спорт

# category.subscriptions
source: Subscriptions
uk: Підписки

# category.taxi
source: Taxi
uk: Таксі

# category.transport
source: Transport
uk: Транспорт

# category.uncategorized
source: Uncategorized
uk: Без категорії

# category.utilities
source: Utilities
uk: Комуналка

# celebration.subtitle
source: Keep going — analytics will be available after 3 entries
uk: Продовжуйте — аналітика стане доступна після 3 записів

# celebration.title
source: Great! First transaction recorded!
uk: Чудово! Перша транзакція записана!

# chart.average
source: Average
uk: Середнє

# chart.day
source: Day
uk: День

# chart.expenses
source: Expenses
uk: Витрати

# common.account
source: Account
uk: Рахунок

# common.add
source: Add
uk: Додати

# common.all
source: All
uk: Всі

# common.apply
source: Apply
uk: Застосувати

# common.cancel
source: Cancel
uk: Скасувати

# common.category
source: Category
uk: Категорія

# common.clear
source: Clear
uk: Очистити

# common.close
source: Close
uk: Закрити

# common.create
source: Create
uk: Створити

# common.date
source: Date
uk: Дата

# common.delete
source: Delete
uk: Видалити

# common.description
source: Description
uk: Опис

# common.details
source: Details
uk: Деталі

# common.done
source: Done
uk: Готово

# common.duplicate
source: Duplicate
uk: Дублювати

# common.edit
source: Edit
uk: Редагувати

# common.from
source: From
uk: Від

# common.no
source: No
uk: Ні

# common.noAccounts
source: No accounts
uk: Немає рахунків

# common.noCategories
source: No categories
uk: Немає категорій

# common.reset
source: Reset
uk: Скинути

# common.retry
source: Retry
uk: Спробувати знову

# common.save
source: Save
uk: Зберегти

# common.select
source: Select
uk: Обрати

# common.selectCategory
source: Select Category
uk: Обрати категорію

# common.showAll %lld
source: Show All (%lld)
uk: Показати всі (%lld)

# common.showMore %lld
source: Show %lld more
uk: Показати ще %lld

# common.to
source: To
uk: До

# common.undo
source: Undo
uk: Скасувати

# common.yes
source: Yes
uk: Так

# confidence.high
source: Confident
uk: Впевнений

# confidence.low
source: Uncertain
uk: Невпевнений

# confidence.medium
source: Possible
uk: Можливо

# currency.eur
source: Euro (€)
uk: Євро (€)

# currency.uah
source: Hryvnia (₴)
uk: Гривня (₴)

# currency.usd
source: Dollar ($)
uk: Долар ($)

# date.today
source: Today
uk: Сьогодні

# date.yesterday
source: Yesterday
uk: Вчора

# detail.balanceImpact
source: Balance Impact
uk: Вплив на баланс

# detail.became
source: Became:
uk: Стало:

# detail.recordDate
source: Record Date:
uk: Дата запису:

# detail.time
source: Time
uk: Час

# detail.transactionDate
source: Transaction Date:
uk: Дата транзакції:

# detail.was
source: Was:
uk: Було:

# edit.amountAndType
source: Amount and Type
uk: Сума та тип

# edit.descriptionOptional
source: Description (optional)
uk: Опис (опціонально)

# edit.enterDescription
source: Enter description
uk: Введіть опис

# edit.fromAccount
source: From Account
uk: З рахунку

# edit.merchantOptional
source: Merchant (optional)
uk: Мерчант (опційно)

# edit.title
source: Edit
uk: Редагування

# edit.toAccount
source: To Account
uk: На рахунок

# edit.transactionDate
source: Transaction Date
uk: Дата транзакції

# edit.type
source: Type
uk: Тип

# error.account.cannotDeleteLast
source: Cannot delete the last account
uk: Неможливо видалити останній рахунок

# error.account.createAnotherFirst
source: Create another account before deleting this one
uk: Створіть інший рахунок перед видаленням цього

# error.account.deleteTransactionsFirst
source: Delete all transactions for this account first
uk: Спершу видаліть всі транзакції цього рахунку

# error.account.hasTransactions
source: Cannot delete account with transactions
uk: Неможливо видалити рахунок з транзакціями

# error.accountRequired
source: Select an account
uk: Оберіть рахунок

# error.alreadyProcessed
source: This transaction has already been processed
uk: Ця транзакція вже оброблена

# error.authenticationFailed
source: Authentication failed
uk: Помилка автентифікації

# error.bankAccountNotFound
source: Bank account not found
uk: Банківський рахунок не знайдено

# error.bankingServiceUnavailable
source: Banking service unavailable
uk: Банківський сервіс недоступний

# error.bankTokenExpired
source: Bank token has expired
uk: Термін дії банківського токена закінчився

# error.bankTransactionFailed
source: Bank transaction failed
uk: Помилка банківської транзакції

# error.category.hasTransactions
source: Category has transactions
uk: Категорія має транзакції

# error.categoryRequired
source: Select a category
uk: Оберіть категорію

# error.dailyLimitExceeded
source: Daily limit exceeded
uk: Перевищено денний ліміт

# error.dataCorruption
source: Data integrity error
uk: Помилка цілісності даних

# error.deleteError
source: Delete error
uk: Помилка видалення

# error.dismissFailed
source: Failed to dismiss transaction
uk: Помилка відхилення транзакції

# error.insufficientFunds
source: Insufficient funds
uk: Недостатньо коштів

# error.invalidAmount
source: Invalid amount
uk: Невірна сума

# error.invalidData
source: Invalid data
uk: Некоректні дані

# error.invalidTransactionData
source: Invalid transaction data
uk: Невірні дані транзакції

# error.loadCategories
source: Failed to load categories
uk: Не вдалося завантажити категорії

# error.networkRetry
source: Network error. Please try again
uk: Помилка мережі. Спробуйте ще раз

# error.networkUnavailable
source: Network unavailable
uk: Мережа недоступна

# error.permissionDenied
source: Permission denied
uk: Доступ заборонено

# error.processFailed
source: Failed to process transaction
uk: Помилка обробки транзакції

# error.recovery.bankingServiceUnavailable
source: Try again later or contact the bank
uk: Спробуйте пізніше або зверніться до банку

# error.recovery.bankTokenExpired
source: Re-authorize in the bank app
uk: Авторизуйтесь повторно в додатку банку

# error.recovery.dailyLimitExceeded
source: Try again tomorrow or increase the limit
uk: Спробуйте завтра або збільшіть ліміт

# error.recovery.dataCorruption
source: Contact support
uk: Зверніться до служби підтримки

# error.recovery.networkUnavailable
source: Check your network connection and try again
uk: Перевірте підключення до мережі та спробуйте ще раз

# error.repo.conflictDetected
source: Conflict detected
uk: Виявлено конфлікт

# error.repo.contextUnavailable
source: Database context unavailable
uk: Контекст бази даних недоступний

# error.repo.entityNotFound
source: Record not found
uk: Запис не знайдено

# error.repo.fetchFailed
source: Fetch failed
uk: Помилка завантаження

# error.repo.invalidData
source: Invalid data
uk: Невірні дані

# error.repo.migrationRequired
source: Database migration required
uk: Потрібна міграція бази даних

# error.repo.saveConflict
source: Save conflict. Please retry.
uk: Конфлікт збереження. Спробуйте ще раз.

# error.repo.saveFailed
source: Save failed
uk: Помилка збереження

# error.syncFailed
source: Sync failed
uk: Помилка синхронізації

# error.title
source: Error
uk: Помилка

# error.validation
source: Validation error
uk: Помилка валідації

# filter.accounts
source: Accounts
uk: Рахунки

# filter.active
source: Active Filters
uk: Активні фільтри

# filter.amount
source: Amount
uk: Сума

# filter.amountFooter
source: Specify a range to filter by amount
uk: Вкажіть діапазон для фільтрації за сумою

# filter.categories
source: Categories
uk: Категорії

# filter.custom
source: Custom Period
uk: Власний період

# filter.date
source: Date
uk: Дата

# filter.period
source: Period
uk: Період

# filter.selectDateRange
source: Select Date Range
uk: Оберіть діапазон дат

# filter.selected %lld
source: %lld selected
uk: %lld обрано

# filter.thisMonth
source: This Month
uk: Цей місяць

# filter.thisWeek
source: This Week
uk: Цей тиждень

# filter.title
source: Filters
uk: Фільтри

# filter.today
source: Today
uk: Сьогодні

# filter.transactionType
source: Transaction Type
uk: Тип транзакції

source: Loading categories...
uk: Завантаження категорій...

# metadata.selectDate
source: Select Date
uk: Оберіть дату

# onboarding.account.balance
source: Starting Balance
uk: Початковий баланс

# onboarding.account.namePlaceholder
source: Account Name
uk: Назва рахунку

# onboarding.account.preset.cash
source: Cash
uk: Готівка

# onboarding.account.preset.monobank
source: Monobank
uk: Монобанк

# onboarding.account.preset.privatbank
source: PrivatBank
uk: ПриватБанк

# onboarding.account.subtitle
source: Set up your main account
uk: Налаштуйте основний рахунок

# onboarding.account.title
source: Your Account
uk: Ваш рахунок

# onboarding.categories.subtitle
source: Choose the categories you use
uk: Оберіть категорії, якими користуєтесь

# onboarding.categories.title
source: Your Categories
uk: Ваші категорії

# onboarding.feature.accounts
source: Multiple accounts & currencies
uk: Декілька рахунків та валют

# onboarding.feature.analytics
source: Smart analytics & insights
uk: Розумна аналітика та статистика

# onboarding.feature.quick
source: Quick expense entry in seconds
uk: Швидкий запис витрат за секунди

# onboarding.next
source: Next
uk: Далі

# onboarding.ready.start
source: Get Started
uk: Почати

# onboarding.ready.subtitle
source: Add your first transaction
uk: Додайте першу транзакцію

# onboarding.ready.title
source: All Set!
uk: Все готово!

# onboarding.skip
source: Skip
uk: Пропустити

# onboarding.welcome.start
source: Get Started
uk: Почати

# onboarding.welcome.subtitle
source: Simple expense tracking for daily use
uk: Простий облік фінансів для щоденного використання

# onboarding.welcome.title
source: Track Your Expenses
uk: Контролюй свої витрати

# pending.accept
source: Accept
uk: Прийняти

# pending.acceptAll
source: Accept All
uk: Прийняти всі

# pending.acceptAndContinue
source: Accept and Continue
uk: Прийняти і продовжити

# pending.acceptAndFinish
source: Accept and Finish
uk: Прийняти і завершити

# pending.badge %lld
source: %lld transactions pending
uk: %lld транзакцій очікують обробки

# pending.complete
source: Done!
uk: Готово!

# pending.dismiss
source: Dismiss
uk: Відхилити

# pending.dismissed
source: Transaction dismissed
uk: Транзакцію відхилено

# pending.empty.subtitle
source: New transactions will appear here after syncing with the bank
uk: Нові транзакції з'являться тут після синхронізації з банком

# pending.empty.title
source: All transactions processed
uk: Всі транзакції оброблені

# pending.learned
source: Learned!
uk: Запам'ятав!

# pending.merchant
source: Merchant
uk: Торгівець

# pending.noCategories
source: No categories
uk: Немає категорій

# pending.processedCount %lld %lld
source: Processed %1$lld of %2$lld transactions
uk: Оброблено %1$lld з %2$lld транзакцій

# pending.processTransaction
source: Process Transaction
uk: Обробити транзакцію

# pending.progress
source: Progress
uk: Прогрес

# pending.rememberChoice
source: Remember choice?
uk: Запам'ятати вибір?

# pending.rememberMerchantCategory %@ %@
source: Always assign "%1$@" to category "%2$@"?
uk: Завжди відносити "%1$@" до категорії "%2$@"?

# pending.rememberSimilar
source: Remember for similar transactions?
uk: Запам'ятати для схожих транзакцій?

# pending.reviewAll
source: Review All
uk: Переглянути всі

# pending.reviewProgress %lld %lld
source: Review All (%1$lld/%2$lld)
uk: Переглянути всі (%1$lld/%2$lld)

# pending.similarTransactions
source: Similar Transactions
uk: Схожі транзакції

# pending.skip
source: Skip
uk: Пропустити

# pending.title
source: Pending
uk: Очікують обробки

# pending.transactionId
source: Transaction ID
uk: ID транзакції

# quickEntry.descriptionPlaceholder
source: What did you buy?
uk: Що купили?

# quickEntry.recent
source: Recent
uk: Останні

# quickEntry.title
source: Add Transaction
uk: Додати транзакцію

source: Search categories
uk: Пошук категорій

source: Search merchants
uk: Пошук продавців

source: Search Results
uk: Результати пошуку

# search.transactions
source: Search by description, category
uk: Пошук за описом, категорією

# split.addAtLeastOne
source: Add at least one split
uk: Додайте хоча б один розділ

# split.addSplit
source: Add Split
uk: Додати розділ

# split.allocation
source: Allocation
uk: Розподіл

# split.amountRequired %lld
source: Enter amount for split %lld
uk: Вкажіть суму для розділу %lld

# split.count %lld
source: %lld splits
uk: %lld розділів

# split.deleteParent.cascade
source: Delete summary and all splits
uk: Видалити сумарну та всі розділи

# split.deleteParent.message
source: This transaction has splits. How do you want to delete it?
uk: Ця транзакція містить розділи. Як ви хочете її видалити?

# split.deleteParent.parentOnly
source: Delete summary only
uk: Видалити лише сумарну

# split.deleteParent.title
source: Delete Summary Transaction?
uk: Видалити сумарну транзакцію?

# split.editSplit
source: Edit Split
uk: Редагувати розподіл

# split.originalTransaction
source: Original Transaction
uk: Оригінальна транзакція

# split.overAllocated
source: Allocated amount exceeds total
uk: Розподілена сума перевищує загальну

# split.remaining
source: Remaining
uk: Залишок

# split.retainParent
source: Keep Original Transaction
uk: Зберегти оригінальну транзакцію

# split.retainParentDescription
source: Keeps the original transaction as a summary
uk: Зберігає оригінальну транзакцію як сумарну

# split.save
source: Save Split
uk: Зберегти розподіл

# split.selectCategory %lld
source: Select category for split %lld
uk: Оберіть категорію для розділу %lld

# split.splits
source: Splits
uk: Розділи

# split.splitTransaction
source: Split
uk: Розділити

# split.title
source: Split Transaction
uk: Розділити транзакцію

# split.underAllocated
source: Not all amount allocated
uk: Не всю суму розподілено

# tab.accounts
source: Accounts
uk: Рахунки

# tab.add
source: Add
uk: Додати

# tab.analytics
source: Analytics
uk: Аналітика

# tab.pending
source: Pending
uk: Очікують

# tab.transactions
source: Transactions
uk: Транзакції

# toast.categorizedCount %lld
source: Categorized %lld transactions
uk: Категоризовано %lld транзакцій

# toast.deletedCount %lld
source: Deleted %lld transactions
uk: Видалено %lld транзакцій

# toast.deletedPartial %lld %lld
source: Deleted %1$lld of %2$lld transactions
uk: Видалено %1$lld з %2$lld транзакцій

# toast.transactionAdded
source: Transaction added successfully
uk: Транзакцію успішно додано

# transaction.deleteConfirm.message
source: This action cannot be undone.
uk: Цю дію неможливо скасувати.

# transaction.deleteConfirm.title
source: Delete Transaction?
uk: Видалити транзакцію?

# transaction.empty.addFirst
source: Add Transaction
uk: Додати транзакцію

# transaction.empty.filtered
source: Try changing filters or search query
uk: Спробуйте змінити фільтри або пошуковий запит

# transaction.empty.subtitle
source: Add your first transaction
uk: Додайте свою першу транзакцію

# transaction.empty.title
source: No Transactions Found
uk: Транзакцій не знайдено

# transactionDetail.title
source: Transaction Details
uk: Деталі транзакції

# transactionType.expense
source: Expense
uk: Витрата

# transactionType.income
source: Income
uk: Дохід

# transactionType.transferIn
source: Transfer (incoming)
uk: Переказ (зарахування)

# transactionType.transferOut
source: Transfer (outgoing)
uk: Переказ (списання)

# trend.7days
source: 7 days
uk: 7 днів

# trend.30days
source: 30 days
uk: 30 днів

# trend.90days
source: 90 days
uk: 90 днів

# validation.account.duplicateTag
source: This tag is already in use
uk: Такий тег вже використовується

# validation.account.emptyName
source: Account name cannot be empty
uk: Назва рахунку не може бути порожньою

# validation.account.emptyTag
source: Tag cannot be empty
uk: Тег не може бути порожнім

# validation.account.invalidTagFormat
source: Tag must start with # and contain only letters and numbers
uk: Тег має починатися з # і містити лише букви та цифри

# validation.account.nameTooLong
source: Account name is too long
uk: Назва рахунку занадто довга

# validation.invalidAmount
source: Enter a valid amount
uk: Вкажіть коректну суму

# validation.invalidBalance
source: Invalid balance format
uk: Невірний формат балансу

# validation.selectCategory
source: Select a category
uk: Оберіть категорію

# validation.selectFromAccount
source: Select a source account
uk: Оберіть рахунок списання

# validation.selectToAccount
source: Select a destination account
uk: Оберіть рахунок надходження

# validation.selectTransferAccounts
source: Select accounts for transfer
uk: Оберіть рахунки для переказу
